solvers/freeFallingPimpleFoam/tutorials/steelBallRunLongerMirrored/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Kinematic pressure  p/rho  [m^2/s^2]
// freeFallingPimpleFoam uses the incompressible pimpleFoam formulation.

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front           { type empty; }
    back            { type empty; }

    // Pressure outlets: zero gradient lets the far-field pressure float.
    top             { type zeroGradient; }
    bottom          { type zeroGradient; }
    farWall         { type zeroGradient; }

    // Sphere: zero gradient (pressure BC follows from velocity BC)
    sphere          { type zeroGradient; }
	
	symmetry		{ type symmetry; }
}

// ************************************************************************* //
