solvers/freeFallingPimpleFoam/tutorials/steelBallRunLongerMirrored/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  C hin's        | Made with: Chin's BlockMeshAuto                 |
|  \\    /   H andy         |                                                 |
|   \\  /    I nterface &   | Project:  {project_name}  |
|    \\/     N avigation    |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    ( 0.000000 0.000000 0.000000 )  // point 0
    ( -10.000000 0.000000 0.000000 )  // point 1
    ( 0.000000 2.000000 0.000000 )  // point 2
    ( 0.000000 -2.000000 0.000000 )  // point 3
    ( 0.000000 22.000000 0.000000 )  // point 4
    ( -10.000000 22.000000 0.000000 )  // point 5
    ( 0.000000 -12.000000 0.000000 )  // point 6
    ( -10.000000 -12.000000 0.000000 )  // point 7
    ( -10.000000 -2.000000 0.000000 )  // point 8
    ( -10.000000 2.000000 0.000000 )  // point 9
    ( -2.000000 0.000000 0.000000 )  // point 10
    ( 0.000000 4.000000 0.000000 )  // point 11
    ( -4.000000 4.000000 0.000000 )  // point 12
    ( -4.000000 -4.000000 0.000000 )  // point 13
    ( 0.000000 -4.000000 0.000000 )  // point 14
    ( -10.000000 -4.000000 0.000000 )  // point 15
    ( -10.000000 4.000000 0.000000 )  // point 16
    ( -4.000000 2.000000 0.000000 )  // point 17
    ( -4.000000 -2.000000 0.000000 )  // point 18
    ( -4.000000 0.000000 0.000000 )  // point 19
    ( -4.000000 22.000000 0.000000 )  // point 20
    ( -4.000000 -12.000000 0.000000 )  // point 21
    ( 0.000000 0.000000 1.000000 )  // point 22
    ( -10.000000 0.000000 1.000000 )  // point 23
    ( 0.000000 2.000000 1.000000 )  // point 24
    ( 0.000000 -2.000000 1.000000 )  // point 25
    ( 0.000000 22.000000 1.000000 )  // point 26
    ( -10.000000 22.000000 1.000000 )  // point 27
    ( 0.000000 -12.000000 1.000000 )  // point 28
    ( -10.000000 -12.000000 1.000000 )  // point 29
    ( -10.000000 -2.000000 1.000000 )  // point 30
    ( -10.000000 2.000000 1.000000 )  // point 31
    ( -2.000000 0.000000 1.000000 )  // point 32
    ( 0.000000 4.000000 1.000000 )  // point 33
    ( -4.000000 4.000000 1.000000 )  // point 34
    ( -4.000000 -4.000000 1.000000 )  // point 35
    ( 0.000000 -4.000000 1.000000 )  // point 36
    ( -10.000000 -4.000000 1.000000 )  // point 37
    ( -10.000000 4.000000 1.000000 )  // point 38
    ( -4.000000 2.000000 1.000000 )  // point 39
    ( -4.000000 -2.000000 1.000000 )  // point 40
    ( -4.000000 0.000000 1.000000 )  // point 41
    ( -4.000000 22.000000 1.000000 )  // point 42
    ( -4.000000 -12.000000 1.000000 )  // point 43
);

blocks
(
    hex (16 12 20 5 38 34 42 27)        (60 160 1)        simpleGrading (1.0 1.0 1.0)        // Block 0
    hex (12 11 4 20 34 33 26 42)        (40 160 1)        simpleGrading (1.0 1.0 1.0)        // Block 1
    hex (9 17 12 16 31 39 34 38)        (60 20 1)        simpleGrading (1.0 1.0 1.0)        // Block 2
    hex (1 19 17 9 23 41 39 31)        (60 20 1)        simpleGrading (1.0 1.0 1.0)        // Block 3
    hex (8 18 19 1 30 40 41 23)        (60 20 1)        simpleGrading (1.0 1.0 1.0)        // Block 4
    hex (15 13 18 8 37 35 40 30)        (60 20 1)        simpleGrading (1.0 1.0 1.0)        // Block 5
    hex (7 21 13 15 29 43 35 37)        (60 80 1)        simpleGrading (1.0 1.0 1.0)        // Block 6
    hex (21 6 14 13 43 28 36 35)        (40 80 1)        simpleGrading (1.0 1.0 1.0)        // Block 7
    hex (17 2 11 12 39 24 33 34)        (40 20 1)        simpleGrading (1.0 1.0 1.0)        // Block 8
    hex (19 10 2 17 41 32 24 39)        (40 20 1)        simpleGrading (1.0 1.0 1.0)        // Block 9
    hex (18 3 10 19 40 25 32 41)        (40 20 1)        simpleGrading (1.0 1.0 1.0)        // Block 10
    hex (13 14 3 18 35 36 25 40)        (40 20 1)        simpleGrading (1.0 1.0 1.0)        // Block 11
);

edges
(
    // Lower sphere arc: v3=(0,-2) → v10=(-2,0)
    // midpoint at 45° below equator: (-√2, -√2) = (-1.4142, -1.4142)
    arc  3 10 ( -1.4142  -1.4142  0.0 )
    arc 25 32 ( -1.4142  -1.4142  1.0 )

    // Upper sphere arc: v10=(-2,0) → v2=(0,2)
    // midpoint at 45° above equator: (-√2, +√2) = (-1.4142, +1.4142)
    arc 10  2 ( -1.4142   1.4142  0.0 )
    arc 32 24 ( -1.4142   1.4142  1.0 )
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (21 6 28 43)
            (7 21 43 29)
        );
    }
    top
    {
        type patch;
        faces
        (
            (20 42 26 4)
            (5 27 42 20)
        );
    }
    symmetry
    {
        type symmetry;
        faces
        (
            (6 14 36 28)
            (11 4 26 33)
            (2 11 33 24)
            (14 3 25 36)
        );
    }
    sphere
    {
        type wall;
        faces
        (
            (3 10 32 25)
            (10 2 24 32)
        );
    }
    farWall
    {
        type wall;
        faces
        (
            (9 31 38 16)
            (15 37 30 8)
            (16 38 27 5)
            (1 23 31 9)
            (7 29 37 15)
            (8 30 23 1)
        );
    }
    front
    {
        type empty;
        faces
        (
            (38 34 42 27)
            (35 36 25 40)
            (29 43 35 37)
            (34 33 26 42)
            (43 28 36 35)
            (31 39 34 38)
            (39 24 33 34)
            (23 41 39 31)
            (41 32 24 39)
            (30 40 41 23)
            (40 25 32 41)
            (37 35 40 30)
        );
    }
    back
    {
        type empty;
        faces
        (
            (16 5 20 12)
            (13 18 3 14)
            (7 15 13 21)
            (12 20 4 11)
            (21 13 14 6)
            (9 16 12 17)
            (17 12 11 2)
            (1 9 17 19)
            (19 17 2 10)
            (8 1 19 18)
            (18 19 10 3)
            (15 8 18 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //